app/views/home/Accueil.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
				<th scope="row">
					<%=i.user.first_name%>