app/controllers/home_controller.rb

  def Accueil
  	@gossip = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def Find_id

  	@first_name = Gossip.find(params[:user_id]).user.first_name

  	@title = Gossip.find(params[:user_id]).title

  	@content = Gossip.find(params[:user_id]).content
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]